error_message = {
    # 인증
    'E000': '정상처리되었습니다.',
    'E001': '토큰 업데이트에 실패하였습니다.',
    'E002': '아이디/비밀번호 또는 권한이 일치하지 않습니다.',
    'E003': '아이디/비밀번호가 유효하지 않습니다.',
    'E004': '해시데이터가 유효하지 않습니다.',
    'E005': '잘못된 토큰입니다.',
    'E006': '토큰생성이 잘못되었습니다.',
    'E007': '권한이 없습니다.',

    # 요청
    'E100': '요청 데이터 복호화에 실패했습니다.',
    'E101': '서버 공용 스토리지에 해당 파일이 없습니다.',
    'E102': 'fileType이 옳지 않습니다.',
    'E103': '매개변수 입력이 필요합니다.',
    'E104': 'savePath가 올바르지 않습니다.',
    'E105': 'propertyType이 옳지 않습니다. (movable/immovable)',

    # PDF
    'E199': '암호화된 PDF파일입니다.',
    'E200': '이미지 파일 저장에 실패했습니다.',
    'E201': 'PDF 이미지 생성에 실패했습니다.',
    'E202': '회전 이미지 생성에 실패했습니다.',

    # Onbid
    'E300': 'Detectron 수행중 에러가 발생하였습니다.',
    'E301': 'Detectron table JSON 저장에 실패했습니다.',
    'E310': '감정평가 정보 추출에 실패했습니다.',
    'E320': '표 구조 분석 중 오류가 발생했습니다.',
    'E330': '평가정보 json파일 생성에 실패했습니다.',
    'E340': 'json파일 sllm 후처리에 실패했습니다.',
    'E341': 'json파일 후처리에 실패했습니다.',
    'E350': 'text pdf 파일 JSON 변환 실패했습니다.',

    # OCR
    'E900': 'OCR 오류 발생',
    'E904': 'load_models 에 실패했습니다.',
    'E906': 'loadImage 에 실패했습니다.',
    'E907': 'OCR detect에 실패했습니다.',
    'E908': 'crop_image 에 실패했습니다.',
    'E909': 'AlignCollatee 에 실패했습니다.',
    'E910': 'EditorPostRGBDataset 에 실패했습니다.',
    'E911': 'FIELD_RELM 생성에 실패했습니다.',
    'E912': 'characterFile 이 존재하지 않습니다.',
    'E915': 'DB에서 OCR 설정값 (OPT) 가져오기에 실패했습니다.',
    'E916': 'OCR Result MetaData JSON 저장에 실패했습니다.',
    'E917': 'OCR Result Text PDF 생성에 실패했습니다.',
    'E918': 'PDF 파일이 없거나 에러입니다.',
    'E919': 'OCR 이력(MD-05) 삽입에 실패했습니다.',

    # Workflow
    'E500': 'Workflow PDF 변환 요청이 실패했습니다.'
}